AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/boards/common/examples/iox4p_fpga/src/iox4.h
// Boards
//#define BOARD_FALCON_PS_CARD 1
//#define BOARD_FALCON_EB 1
//#define BOARD_FALCON_SIP_MCU_CARD_REVA 1
//#define BOARD_FALCON_BGA_MCU_CARD_REVA 1
#define BOARD_FALCON_BGA_MCU_CARD_REVB 1
//#define BOARD_FALCON_SIP_MCU_CARD_REVB 1

// Operational Modes
#define MODE_DEFAULT 0
#define MODE_IOMx_TO_1V8_PSRAM 1
#define MODE_IOMx_I2C_TO_FRAM 2
#define MODE_IOM0_TO_IOS_LB 3
#define MODE_MSPI02_TO_1V8_QPSRAM_OCTAL_FLASH 4
#define MODE_MSPI0_TO_DISPLAY 5
#define MODE_MSPI2_TO_DISPLAY 6
#define MODE_PC_CONN 7

// GPIO Net Assignments
#define GPIO_ARM_TCK_SWCLK 7
#define GPIO_ARM_TMS_SWDIO 8
#define GPIO_DEBUG_TGT_SEL0 9
#define GPIO_DEBUG_TGT_SEL1 10
#define GPIO_20P_CON_SRC_SEL 11
#define GPIO_SHELBY_ADC_REF_LOAD_EN 12
#define GPIO_CTRL_VDDC 13
#define GPIO_CTRL_VDDF 14
#define GPIO_CTRL_VDDH 15
#define GPIO_CTRL_VDDA 16
#define GPIO_CTRL_VCCIO_FPGA 17
#define GPIO_CTRL_PER 18
#define GPIO_VDDC_ISINK_EN 19
#define GPIO_VDDC_ISINK_RANGE_SEL_A0 22
#define GPIO_VDDC_ISINK_RANGE_SEL_A1 23
#define GPIO_VDDM_ISINK_EN 24
#define GPIO_VDDM_ISINK_RANGE_SEL_A0 25
#define GPIO_VDDM_ISINK_RANGE_SEL_A1 26
#define GPIO_PAD_TIA_RSEL_A0 27
#define GPIO_PAD_TIA_RSEL_A1 28
#define GPIO_SHELBY_IBIAS_SEL 29
#define GPIO_XTAL_CL_SEL_A0 30
#define GPIO_XTAL_CL_SEL_A1 31
#define GPIO_DAC_AD5791_CLRb 32
#define GPIO_AMUX_11_SEL1 33
#define GPIO_AMUX_11_SEL0 34
#define GPIO_AMUX_12_13_SEL1 35
#define GPIO_AMUX_12_13_SEL0 36
#define GPIO_AMUX_14_15_SEL1 37
#define GPIO_AMUX_14_15_SEL0 38
#define GPIO_LED_BLUE 39
#define GPIO_SW2 40
#define GPIO_USB_PWR_EN 41
#define GPIO_DAQ_ADC5_SEL0 42
#define GPIO_DAQ_ADC5_SEL1 43
#define GPIO_DAQ_ADC67_SEL0 44
#define GPIO_DAQ_ADC67_SEL1 45
#define GPIO_AMUX_18_19_SEL0 46
#define GPIO_AMUX_18_19_SEL1 47
#define GPIO_AMUX_16_17_SEL0 48
#define GPIO_AMUX_16_17_SEL1 49
#define GPIO_DAC20_FILT_SEL0 50
#define GPIO_CTRL_VDDS 51
#define GPIO_CTRL_VDDBH 52
#define GPIO_CTRL_VDDC_LV 53
#define GPIO_CTRL_VDDH2 54
#define GPIO_CTRL_VDD18 55
#define GPIO_LPADC_D0_OE 56
#define GPIO_LPADC_D0_SEL 57
#define GPIO_XTAL_XI_GND_EN 58
#define GPIO_DAQB_ADC67_SEL1 59
#define GPIO_DAQB_ADC67_SEL0 60
#define GPIO_CTRL_VDDB 61
#define GPIO_CTRL_VDDC_ISINK1 62
#define GPIO_CTRL_VDDM_ISINK2 63
#define GPIO_CTRL_VDDP 64
#define GPIO_VDDC_ISINK_DISABLE 65
#define GPIO_VDDM_ISINK_DISABLE 66
#define GPIO_ABUF_REF_SEL1 67
#define GPIO_ABUF_REF_SEL0 68
#define GPIO_DAC20_FILT_SEL1 69
#define GPIO_MIPI_SEL 70
#define GPIO_MIPI_CTRL 71
#define GPIO_LPADC_D1_OE 72
#define GPIO_LPADC_D1_SEL 73
#define GPIO_CTRL_RAIL_PSU 74
#define GPIO_UPPER_IO_CTRL 75
#define GPIO_IOM_PC_SEL 76
#define GPIO_IOM_MEM_SEL 77
#define GPIO_IOM_VOLT_SEL 78
#define GPIO_IOM_ANA_SEL 79
#define GPIO_IOM0_LB_SEL 80
#define GPIO_IOS_LB_SEL 81
#define GPIO_PC_SEL 82
#define GPIO_DAC_PERF_MUX_SEL2 83
#define GPIO_DAC_PERF_MUX_SEL1 84
#define GPIO_DAC_PERF_MUX_SEL0 85
#define GPIO_DAQ_DAC7_SEL0 86
#define GPIO_DAQ_DAC7_SEL1 87
#define GPIO_MSPI_nRST_IOX 88
#define GPIO_AT_UART_SEL 89
#define GPIO_GP19_ATST1_A0_SEL 90
#define GPIO_GP19_ATST1_A1_SEL 91
#define GPIO_GP19_ATST1_VV_RLOAD_SEL 92
#define GPIO_GP19_ATST1_IV_GAIN_SEL 93
#define GPIO_GP19_ATST1_XO_SEL 94
#define GPIO_GP18_ATST2_A0_SEL 95
#define GPIO_GP18_ATST2_A1_SEL 96
#define GPIO_GP18_ATST2_VV_RLOAD_SEL 97
#define GPIO_CTRL_VDDAUDD 98
#define GPIO_CTRL_VDDAUDA 99
#define GPIO_CTRL_VDDUSB33 100
#define GPIO_CTRL_VDDUSB0P9 101
#define GPIO_CTRL_VDDP_A 102
#define GPIO_CTRL_VDDA_A 103
#define GPIO_CTRL_VDDH_A 104
#define GPIO_CTRL_VDDH2_A 105
#define GPIO_CTRL_VDDB_A 106
#define GPIO_CTRL_VDD18_A 107
#define GPIO_CTRL_VDDAUDD_A 108
#define GPIO_CTRL_VDDAUDA_A 109
#define GPIO_CTRL_VDDUSB33_A 110
#define GPIO_CTRL_VDDUSB0P9_A 111
#define GPIO_CTRL_PER_A 112
#define GPIO_CTRL_VDDC_A 113
#define GPIO_CTRL_VDDC_LV_A 114
#define GPIO_CTRL_VDDF_A 115
#define GPIO_CTRL_VDDS_A 116
#define GPIO_CTRL_VDDSBH_A 117
#define GPIO_RAIL_PSU_RSEL_A0 118
#define GPIO_RAIL_PSU_RSEL_A1 119
#define GPIO_V1_PSU_RSEL_A0 120
#define GPIO_V1_PSU_RSEL_A1 121
#define GPIO_MSPI0_SEL3 122
#define GPIO_MSPI0_SEL2 123
#define GPIO_MSPI0_SEL1 124
#define GPIO_MSPI0_SEL0 125
#define GPIO_MSPI2_SEL3 126
#define GPIO_MSPI2_SEL2 127
#define GPIO_MSPI2_SEL1 128
#define GPIO_MSPI2_SEL0 129
#define GPIO_MSPI02_PSRAM_CE_SEL0 130
#define GPIO_MSPI02_PSRAM_CE_SEL1 131
#define GPIO_IOM1_ANA_SEL 132

#if defined BOARD_FALCON_BGA_MCU_CARD_REVB || defined BOARD_FALCON_BGA_MCU_CARD_REVA
#define GPIO_MSPI1_SEL3 133
#define GPIO_MSPI1_SEL2 134
#define GPIO_MSPI1_SEL1 135
#define GPIO_MSPI1_SEL0 136
#endif

#ifdef BOARD_FALCON_EB
#define GPIO_DMUX_NC_SEL 19
#define GPIO_IOM_NC_SEL 23
#define GPIO_IOM1_DISP_SEL 24
#define GPIO_IOM7_NC_SEL 35
#endif

#if defined BOARD_FALCON_BGA_MCU_CARD_REVB || defined BOARD_FALCON_SIP_MCU_CARD_REVB
#define DISP_CLK_SEL 138
#define SWO_ARMADA_EN 139
#define POWER_MUX_STATE 0
#endif

#if defined BOARD_FALCON_BGA_MCU_CARD_REVA || defined BOARD_FALCON_SIP_MCU_CARD_REVA
#define POWER_MUX_STATE 1
#endif
